#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "PIDP-SERVICE-ACCOUNT"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Service account for Provider Identity Portal. Authorizes internal maintenance endpoint calls"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIMARY-CARE.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
        id                                         = "1bbd442b-ab81-48d6-8740-d029a65dbc0b"
        name                                       = "Primary Care"
      ~ valid_redirect_uris                        = [
          - "http://localhost:8080/*",
            # (21 unchanged elements hidden)
        ]
        # (23 unchanged attributes hidden)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PRIMARY-CARE.keycloak_openid_hardcoded_role_protocol_mapper.default-role-mapper will be created
  + resource "keycloak_openid_hardcoded_role_protocol_mapper" "default-role-mapper" {
      + client_id = "1bbd442b-ab81-48d6-8740-d029a65dbc0b"
      + id        = (known after apply)
      + name      = "default-role-mapper"
      + realm_id  = "moh_applications"
      + role_id   = "836b14af-c9e7-4879-9673-d5d1a996b6b5"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.module.client-roles.keycloak_role.ROLES["service_account"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "service_account"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PIDP-SERVICE-ACCOUNT/service_account"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "service_account"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.module.client-roles.keycloak_role.ROLES["service_account"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "service_account"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE-ACCOUNT.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PIDP-SERVICE-ACCOUNT/service_account"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = (known after apply)
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "service_account"
      + service_account_user_id = (known after apply)
    }

Plan: 9 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*